[options]
mode bmc
depth 16
expect pass,fail

[engines]
smtbmc boolector

[script]
read_verilog -sv test_fm.v
read_rtlil mutated.il
prep -top testbench
flatten
opt -fast

[files]
test_fm.v
mutated.il
